/*
Запросить у пользователя год рождения.
Если возраст больше 18 лет - сообщить о доступе к сервису, в противном случае - о запрете.
Если пользователю меньше 12 - посоветовать другой сервис. Если пользователь ввел не число - сообщить ему об этом
*/

var ERROR_INPUT = "Вы не ввели дату в указанном формате";
var dateBirth = prompt("Введите дату в формате ГГГГ-ММ-ДД");

// Скрипт с использованием оператора if-else
if (dateBirth == null) {
    alert(ERROR_INPUT);
} else {

    var ageYear = getCurrentAge(dateBirth);

    if (ageYear == 0) {
        alert(ERROR_INPUT);
        
    } else {
        if (ageYear >= 18) {
            alert("Для Вас открыты все пути! Вам все равно, куда идти");
            
        } else {
            if (ageYear <= 12) {
                alert("Смотри, дружок, мультики по TV");
            } else {
                alert("Дорогой тинейджер, наши гуру не придумали занятие для тебя");
            }
            
        }
        
    }
}

// Скрипт с помощью тернарного оператора. Упрощенный вариант :)
var ageY = getCurrentAge(dateBirth);
var userMessage = (ageY == 0) || (dateBirth == null) ? ERROR_INPUT : ageY >= 18 ? "Для Вас открыты все пути! Вам все равно, куда идти" : ageY <= 12 && !0 ? "Смотри, дружок, мультики по TV" : "Дорогой тинейджер, наши гуру не придумали занятие для тебя" ;
alert(userMessage);

/* Выделить число лет на текущую дату из даты в формате ГГГГ-ММ-ДД
    Если введено "что-то" не в указанном формате, будет 0 */
    function getCurrentAge(date) {
        return((new Date().getTime() - new Date(date))/(24 * 3600 * 365.25 * 1000)) | 0; 
     }

